
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
問題

"晴れ" という文字列を引数で渡した時に

明日の天気は晴れです
とターミナルに表示されるようなメソッドを作成し、
それを呼び出すためのコードを書いてください。

ただし、メソッドの外で

1
puts weather_forecast
を実行した時に上記の結果が表示されるものとします。

=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
def weather_forecast
  weather = "晴れ"
  return "明日の天気は#{weather}です"
end

puts weather_forecast





#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
解説


=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
