
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
問題

ユーザーに数字を入力してもらい、その数の回数だけHello!と表示させるコードを記述してください。

雛形

def output()
end

puts "何回表示させますか？"

output()

=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------


def output
  puts "何回表示させますか"
  inp = gets.to_i

  puts "Hello\n" * inp
end

output




#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
解説
def output(num)
  num.times{ puts "Hello!" }
end

puts "何回表示させますか？"
num = gets.to_i
output(num)

=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
