
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
問題

以下の仕様を満たすメソッドを作成しましょう。

・メソッド外で定義された３つの数字をそれぞれ仮引数a,b,cとしてメソッド内で使用する。
・第一引数と第二引数は足し算をし、変数abに代入。
・第三引数が3以下の場合は変数abを第三引数の値で割り、結果を出力する。
・4以上の場合は変数abを第三引数の値で掛け、結果を出力する。

ヒント
(1,5,3)　→　(1+5)÷3　→　2

(1,5,5)　→　(1+5)×5 　→　30

出力例：
num(1,5,3) → 2
num(1,5,5) → 30
num(1,9,-2) → -5


=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------

def num(a,b,c)
  if c <= 3
    puts (a+b)/c
  else
    puts (a+b)*c
  end
end
a = 1
b = 5
c = 5

num(a,b,c)







#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
解説

def num(a,b,c)
  ab = a + b
  if c <= 3
    puts (ab / c)
  else
    puts (ab * c)
  end
end

=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
