
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
問題

正の整数を入力します。その整数が、
10の倍数（10,20,30...）からの差が
2以内であるときはTrue
それ以外は10の倍数との差は○ですと表示されるようにしましょう。

出力例：
near_ten(12)→True
near_ten(17)→10の倍数との差は3です
near_ten(23)→10の倍数との差は3です

=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------

def near_ten(int)
  oneInt = int % 10
  add = 10 - oneInt
  if oneInt <= 2 || oneInt >= 8
    puts "True"
  elsif oneInt > add
    puts "10の倍数との差は#{add}です"
  else
    puts "10の倍数との差は#{oneInt}です"
  end
end

int = 14

near_ten(int)




#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
解説


=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
