
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
問題

二桁以上の整数を入力すると、十の位と一の位の数字をもとに、足し算、掛け算を行い、最後にそれぞれの結果を足し合わせて出力するプログラムをRubyで作成してください。

ターミナルでの入力例

> 二桁の整数を入力してください
> 15

# 1 + 5 と 1 × 5 をそれぞれ計算

> 足し算結果と掛け算結果の合計値は11です


=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------

puts "二桁の整数を入力してください"

num = gets.to_i

def math(num)
  a = num / 10
  b = num % 10
  c = a + b
  d = a * b

  puts "足し算結果と掛け算結果の合計値は#{c+d}です"
end

math(num)




#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
解説

def addition(a, b)
  a + b
end

def multiplication(a,b)
  a * b
end

def slice_num(num)
  # 10の位
  tens_place = (num / 10) % 10
  # 1の位
  ones_place = (num / 1) % 10
  return tens_place, ones_place
end

puts "二桁の整数を入力してください"
input = gets.to_i
X, Y = slice_num(input)
add_result = addition(X, Y)
multiple_result = multiplication(X, Y)
puts "足し算結果と掛け算結果の合計値は#{add_result + multiple_result}です"

=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
