
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
問題
price = 300

def calculate_price_with_tax
  tax = 0.1
  return price + price * tax
end

calculate_price_with_tax

以下のプログラムを実行するとエラーが起きます。
①エラーが起きた原因
②正しいソースコード
をそれぞれ答えてください。

=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------


price = 300

def calculate_price_with_tax(price)
  tax = 0.1
  return price + price * tax
end

puts calculate_price_with_tax(price).to_i




#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
=begin 
解説


=end
#----------------------------------------
puts "----------------------------------------"
#----------------------------------------
